{
  "_name_or_path": "deepseek-ai/DeepSeek-R1-0528",
  "architectures": [
    "TenstorrentDeepSeekR10528ForCausalLM"
  ],
  "model_type": "llama",
  "mock_served_model_name": "deepseek-ai/DeepSeek-R1-0528",
  "vocab_size": 131072,
  "hidden_size": 1,
  "intermediate_size": 4,
  "num_hidden_layers": 1,
  "num_attention_heads": 1,
  "num_key_value_heads": 1,
  "max_position_embeddings": 8192,
  "bos_token_id": 1,
  "eos_token_id": 2,
  "pad_token_id": 0,
  "mock_max_generated_tokens": 2048,
  "mock_tsu": 500.0
}
